Repository: matthieuy/battleship-game
Catalog: translations/js.*.xlf
Languages: fr

source: Name of the game
fr: Nom de la partie

source: gridsize
fr: Taille de la grille

source: nb_players
fr: %nb% joueurs

source: create_date
fr: Date de création

source: Creator
fr: Créateur

source: Players
fr: Joueurs

source: Player
fr: Joueur

source: Team
fr: Équipe

source: Status
fr: Statut

source: waiting_player
fr: Attente de nouveau joueur

source: game_full
fr: Partie complète

source: Color
fr: Couleur

source: Change color
fr: Changer la couleur

source: AI
fr: IA

source: Remove the player
fr: Retirer le joueur

source: loading
fr: Chargement...

source: no_player
fr: Aucun joueur dans la partie

source: penalty_name
fr: Pénalité

# penalty_desc
source: Over a certain time without playing,<br>the player takes a shot on one of his boats.
fr: Passé un certain délais sans jouer,<br>le joueur prend un tir sur un de ses bateaux.

source: enabled
fr: Activé

source: disabled
fr: Désactivé

source: weapon_name
fr: Armes

# weapon_desc
source: Players can use their points <br>for use special weapon.<br><br>(see scores table)
fr: Les joueurs peuvent utiliser leurs points <br>pour utiliser des armes spéciales.<br><br>(voir tableau des scores)

source: bonus_name
fr: Bonus

# bonus_desc
source: Players can catch bonus
fr: Les joueurs peuvent attraper des bonus

source: Can't load game
fr: Impossible de charger la partie

source: Can't change size !
fr: Impossible de changer de taille !

source: Can't change max player
fr: Impossible de changer le nombre maximum de joueur

source: Can't change color
fr: Impossible de changer de couleur

source: Could not join : game is full
fr: Impossible de rejoindre : Partie pleine

source: Can't join/leave game
fr: Impossible de rejoindre/quitter la partie

source: You are already in the game
fr: vous etes déjà dans la partie

source: Any AI available
fr: Aucun IA disponible

source: Error with persist data
fr: Erreur lors de la sauvegarde des données

source: error_allow_create
fr: Vous n'etes pas autorisé à créer une partie

source: Not allowed
fr: Non autorisé

source: Bad option
fr: Mauvaise option

source: Wrong color
fr: Couleur incorrect

source: Player not found
fr: Joueur introuvable

source: Can't change team
fr: Impossible de changer d'équipe

# btn_join
source: Join
fr: Rejoindre

# btn_join_tip
source: Join the game.
fr: Rejoindre la partie.

# btn_leave
source: Leave
fr: Quitter

# btn_leave_tip
source: Leave the game.
fr: Quitter la partie.

# btn_ai
source: Add a AI
fr: Ajouter un IA

# btn_ai_tip
source: Add a player managed by the computer.
fr: Ajouter un joueur géré par l'ordinateur.

source: Can't add AI
fr: Impossible d'ajouter un IA

source: Can't change order
fr: Impossible de changer l'ordre

source: btn_delete
fr: Supprimer

source: btn_delete_tip
fr: Supprimer cette partie

source: btn_delete_confirm
fr: Etes-vous sur de vouloir supprimer cette partie ?

source: btn_run
fr: Lancer

source: btn_run_tip
fr: Quand tout le monde est pret<br>et les options configurées : vous pouvez lancer la partie !

source: error_run_team
fr: La partie doit etre constituée de PLUSIEURS équipes !

source: error_run_emptyteam
fr: Aucun joueur dans l'équipe #%team% !

source: error_run_ai
fr: La partie contient uniquement des AI !

source: confirm_run
fr: Are you sure to start the game ?

# error_run
source: Can't run
fr: Impossible de lancer la partie

source: shoot_of
fr: Tir de %name%

source: boat_of
fr: Bateau de %name%

source: your_boat
fr: Votre bateau

source: shoot_your_boat
fr: Impossible de tirer sur son bateau !

source: your_shot
fr: Votre tir

source: winner_list
fr: Vainqueur : %list%

source: waiting_list
fr: En attente des tirs de %list%

source: points_plurial
fr: [0,1]%nb% point|]1,Inf[%nb% points

source: Price
fr: Prix

source: Rotate
fr: Rotation

source: Select
fr: Sélectionner

source: weapon.bomber
fr: Bombardier

source: weapon.gust
fr: Rafale

source: weapon.mortar
fr: Mortier

source: weapon.flash
fr: Flash

source: Close
fr: Fermer

source: gameover
fr: La partie est terminée

source: error_shoot
fr: Vous ne pouvez pas tirer ici

source: error_tour
fr: Vous ne pouvez pas jouer maintenant !

source: already_shoot
fr: Quelqu'un a déjà tiré ici !

source: team_shoot
fr: Le tir allié est interdit !

source: error_boat404
fr: Bateau introuvable

source: penalty_on
fr: Pénalité pour %name%
